[{
        "ticker": "CPRT",
        "exchange": "NASDAQ",
        "sector": "Consumer Cyclical",
        "type": "Stock",
        "industry": "Auto & Truck Dealerships",
        "description": "Copart, Inc. engages in the provision of online auctions and vehicle remarketing services. It provides vehicle sellers with a full range of services to process and sell vehicles primarily over the internet through Virtual Bidding Third Generation Internet auction-style sales technology. The firm sells the vehicles principally to licensed vehicle dismantlers, rebuilders, repair licensees, used vehicle dealers, and exporters and at certain locations, as well as to the general public. The company’s services include online seller access, salvage estimation services, estimating services, end-of-life vehicle processing, virtual insured exchange, transportation services, vehicle inspection stations, on-demand reporting, DMV processing, and vehicle processing programs. It operates through the United States and International segments. Copart was founded by Willis J. Johnson in 1982 and is headquartered in Dallas, TX.",
        "peratio": 31.51,
        "expectedpe": 80.71,
        "expectedpeg": "51.10 - 71.68",
        "dividendYield": "0.00 x 1200",
        "totalLiabilities": 1842350,
        "debtEquity": 1.21,
        "totalCurrentAssets": "0.00 x 900",
        "totalCurrentLiab": "70.27 - 71.25",
        "currentRatio": 2.26
    },
    {
        "ticker": "AMGN",
        "exchange": "NASDAQ",
        "sector": "Healthcare",
        "type": "Stock",
        "industry": "Drug Manufacturers—General",
        "description": "Amgen, Inc. is a biotechnology company, which engages in the discovery, development, manufacture, and marketing of human therapeutics. It operates through Human Therapeutics segment. The company was founded by William K. Bowes, Jr., Franklin Pitcher Johnson, Jr., George B. Rathmann, and Joseph Rubinfeld on April 8, 1980 and is headquartered in Thousand Oaks, CA.",
        "peratio": 18.86,
        "expectedpe": 258.76,
        "expectedpeg": "223.30 - 296.67",
        "dividendYield": "0.00 x 900",
        "totalLiabilities": 2509840,
        "debtEquity": 0.65,
        "totalCurrentAssets": "0.00 x 1200",
        "totalCurrentLiab": "227.37 - 231.80",
        "currentRatio": 12.11
    },
    {
        "ticker": "CMCSA",
        "exchange": "NASDAQ",
        "sector": "Communication Services",
        "type": "Stock",
        "industry": "Telecom Services",
        "description": "Comcast Corp. engages in the provision of video, Internet, and phone services. It operates through the following segments: Cable Communications, Media, Studios, Theme Parks, and Sky. The Cable Communications segment consists of Comcast Cable, which is a provider of broadband, video, voice, wireless, and other services to residential customers in the United States under the Xfinity brand. The Media segment consists of NBCUniversal’s television and streaming platforms, including national, regional, and international cable networks. The Studios segment focuses on NBCUniversal’s film and television studio production and distribution operations. The Theme Parks segment operates Universal theme parks in Orlando, Florida, Hollywood, California, Osaka, Japan, and Beijing, China. The Sky segment provides operations of Sky, one of Europe’s entertainment companies, which primarily includes a direct-to-consumer business, providing video, broadband, voice and wireless phone services, and a content business, operating entertainment networks, the Sky News broadcast network, and Sky Sports networks. The company was founded in 1963 and is headquartered in Philadelphia, PA.",
        "peratio": 29.67,
        "expectedpe": 44.4,
        "expectedpeg": "28.39 - 48.42",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 21006606,
        "debtEquity": 1,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "35.61 - 36.47",
        "currentRatio": 1.21
    },
    {
        "ticker": "KLAC",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Semiconductor Equipment & Materials",
        "description": "KLA Corp. engages in the supply of process control and yield management solutions for the semiconductor and related nano-electronics industries. The company operates through the following segments: Semiconductor Process Control, Specialty Semiconductor Process, PCB, Display & Component Inspection, and Other. The Semiconductor Process Control segment provides a comprehensive portfolio of inspection, metrology and data analytics products and related services. The Specialty Semiconductor Process segment develops and sells advanced vacuum deposition and etching process tools. The PCB, Display and Component Inspection segment enables electronic device manufacturers to inspect, test and measure PCBs, flat panel displays and ICs to verify their quality. Its products include manufactured chips, reticle, packaging, surface profilers, nanochemical testers, KT pro equipment, and compound semiconductors. The company was founded in April 1997 and is headquartered in Milpitas, CA.",
        "peratio": 15.92,
        "expectedpe": 432.05,
        "expectedpeg": "250.20 - 429.46",
        "dividendYield": "0.00 x 1200",
        "totalLiabilities": 1208971,
        "debtEquity": 1.38,
        "totalCurrentAssets": "0.00 x 1000",
        "totalCurrentLiab": "376.49 - 389.17",
        "currentRatio": 24.33
    },
    {
        "ticker": "PCAR",
        "exchange": "NASDAQ",
        "sector": "Industrials",
        "type": "Stock",
        "industry": "Farm & Heavy Construction Machinery",
        "description": "PACCAR, Inc. is a global technology company, which engages in the design and manufacture of light, medium, and heavy-duty trucks. It operates through the following segments: Truck, Parts and Financial Services. The Truck segment designs and manufactures heavy, medium, and light duty diesel trucks which are marketed under the Kenworth, Peterbilt, and DAF brands. The Parts segment distributes aftermarket parts for trucks and related commercial vehicles. The Financial Services segment provides finance and leasing products and services provided to truck customers and dealers. The company was founded by William Pigott Sr. in 1905 and is headquartered in Bellevue, WA.",
        "peratio": 19.78,
        "expectedpe": 75.63,
        "expectedpeg": "51.33 - 76.72",
        "dividendYield": "0.00 x 1300",
        "totalLiabilities": 3320320,
        "debtEquity": 0.94,
        "totalCurrentAssets": "0.00 x 900",
        "totalCurrentLiab": "75.49 - 76.42",
        "currentRatio": 3.84
    },
    {
        "ticker": "CTAS",
        "exchange": "NASDAQ",
        "sector": "Industrials",
        "type": "Stock",
        "industry": "Specialty Business Services",
        "description": "Cintas Corp. engages in the provision of corporate identity uniforms through rental and sales programs. It operates through the following segments: Uniform Rental and Facility Services, First Aid and Safety Services, and All Other. The Uniform Rental and Facility Services segment consists of the rental and servicing of uniforms and other garments including flame resistant clothing, mats, mops and shop towels, and other ancillary items. The First Aid and Safety Services segment includes first aid and safety products and services. The All Other segment contains fire protection services and its direct sale business. The Corporate segment consists of corporate assets such as cash and marketable securities. The company was founded by Richard T. Farmer in 1968 and is headquartered in Cincinnati, OH.",
        "peratio": 35.71,
        "expectedpe": 495.55,
        "expectedpeg": "343.86 - 470.23",
        "dividendYield": "0.00 x 1000",
        "totalLiabilities": 352205,
        "debtEquity": 1.33,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "435.17 - 440.39",
        "currentRatio": 12.3
    },
    {
        "ticker": "PAYX",
        "exchange": "NASDAQ",
        "sector": "Industrials",
        "type": "Stock",
        "industry": "Staffing & Employment Services",
        "description": "Paychex, Inc. engages in the provision of human capital management solutions for payroll, human resources, insurance and retirement for small and medium-sized businesses. Its solutions include payroll services, hiring services, business insurance, time and attendance, employee benefits, finance and payments, human resources services and startup services. The company was founded by Blase Thomas Golisano in 1971 and is headquartered in Rochester, NY.",
        "peratio": 27.82,
        "expectedpe": 120.99,
        "expectedpeg": "105.66 - 141.92",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 1681316,
        "debtEquity": 0.98,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "111.55 - 113.12",
        "currentRatio": 4.05
    },
    {
        "ticker": "LRCX",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Semiconductor Equipment & Materials",
        "description": "Lam Research Corp. engages in manufacturing and servicing of wafer processing semiconductor manufacturing equipment. It operates through the following geographical segments: the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. It offers thin film deposition, plasma etch, photoresist strip, and wafer cleaning. The company was founded by David K. Lam on January 21, 1980, and is headquartered in Fremont, CA.",
        "peratio": 13.26,
        "expectedpe": 510.08,
        "expectedpeg": "299.59 - 574.79",
        "dividendYield": "0.00 x 1000",
        "totalLiabilities": 1281071,
        "debtEquity": 1.49,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "481.95 - 495.48",
        "currentRatio": 37.22
    },
    {
        "ticker": "ADSK",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Software—Application",
        "description": "Autodesk, Inc. engages in the design of software and services. Its products include AutoCAD, BIM 360, Civil 3D, Fusion 360, InfraWorks, Inventor, Maya, PlanGrid, Revit, Shotgun, and 3ds Max. The firm also offers product development and manufacturing software, which provides manufacturers in the automotive, transportation, industrial machinery, consumer products, and building product industries with comprehensive digital design, engineering, and production solutions. Its architecture, engineering, and construction software improves the way buildings, factories, and infrastructure are designed, built, and used. The firm is also involved in digital media and entertainment, which consists of tools for digital sculpting, modeling, animation, effects, rendering, and compositing for design visualization, visual effects, and games production. The company was founded by John Walker in April 1982 and is headquartered in San Francisco, CA.",
        "peratio": 54.39,
        "expectedpe": 232.21,
        "expectedpeg": "163.20 - 235.01",
        "dividendYield": "0.00 x 900",
        "totalLiabilities": 1358511,
        "debtEquity": 1.51,
        "totalCurrentAssets": "0.00 x 900",
        "totalCurrentLiab": "203.07 - 207.58",
        "currentRatio": 3.76
    },
    {
        "ticker": "ROST",
        "exchange": "NASDAQ",
        "sector": "Consumer Cyclical",
        "type": "Stock",
        "industry": "Apparel Retail",
        "description": "Ross Stores, Inc. engages in the operation of off-price retail apparel and home accessories stores. Its products include branded and designer apparel, accessories, footwear, and home fashions through the Dress for Less and dd's DISCOUNTS brands. The company was founded by Stuart G. Moldaw in 1957 and is headquartered in Dublin, CA.",
        "peratio": 24.89,
        "expectedpe": 123.71,
        "expectedpeg": "69.24 - 122.45",
        "dividendYield": "0.00 x 1300",
        "totalLiabilities": 2260764,
        "debtEquity": 0.99,
        "totalCurrentAssets": "0.00 x 1000",
        "totalCurrentLiab": "108.28 - 110.36",
        "currentRatio": 4.38
    },
    {
        "ticker": "MNST",
        "exchange": "NASDAQ",
        "sector": "Consumer Defensive",
        "type": "Stock",
        "industry": "Beverages—Non-Alcoholic",
        "description": "Monster Beverage Corp. is a holding company, which engages in the development, marketing, sale, and distribution of energy drink beverages and concentrates. It operates through the following segments: Monster Energy Drinks, Strategic Brands, and Other. The Monster Energy Drinks segment sells ready-to-drink packaged energy drinks to bottlers and full-service beverage distributors. The Strategic Brands segment sells concentrates and beverage bases to authorized bottling and canning operations. The Other segment consists of certain products sold by its subsidiary, American Fruits and Flavors LLC to independent third-party customers. The company was founded on April 25, 1990, and is headquartered in Corona, CA.",
        "peratio": 46.66,
        "expectedpe": 110.29,
        "expectedpeg": "73.09 - 105.45",
        "dividendYield": "0.00 x 900",
        "totalLiabilities": 1993123,
        "debtEquity": 0.87,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "102.68 - 103.70",
        "currentRatio": 2.21
    },
    {
        "ticker": "ADBE",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Software—Infrastructure",
        "description": "Adobe, Inc. engages in the provision of digital marketing and media solutions. It operates through the following segments: Digital Media, Digital Experience, and Publishing and Advertising. The Digital Media segment offers creative cloud services, which allow members to download and install the latest versions of products, such as Adobe Photoshop, Adobe Illustrator, Adobe Premiere Pro, Adobe Photoshop Lightroom and Adobe InDesign, as well as utilize other tools, such as Adobe Acrobat. The Digital Experience segment provides solutions, including analytics, social marketing, targeting, media optimization, digital experience management, and cross-channel campaign management, as well as premium video delivery and monetization. The Publishing and Advertising segment includes legacy products and services for eLearning solutions, technical document publishing, web application development, and high-end printing. The company was founded by Charles M. Geschke and John E. Warnock in December 1982 and is headquartered in San Jose, CA.",
        "peratio": 34.48,
        "expectedpe": 387.81,
        "expectedpeg": "274.73 - 473.49",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 2920284,
        "debtEquity": 1.27,
        "totalCurrentAssets": "0.00 x 900",
        "totalCurrentLiab": "343.50 - 348.69",
        "currentRatio": 10.03
    },
    {
        "ticker": "FISV",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Information Technology Services",
        "description": "Fiserv, Inc. engages in the provision of financial services technology. It operates through the following segments: Merchant Acceptance, Financial Technology, and Payments and Network. The Merchant Acceptance segment provides commerce enabling solutions and serves merchants of all sizes around the world. The Financial Technology segment offers technology solutions needed to run operations, including products and services that enable financial institutions to process customer deposit and loan accounts. The Payments and Network segment includes the provision of services to financial institutions and corporate clients with products and services required to process digital payment transactions. The company was founded by Leslie M. Muma and George D. Dalton on July 31, 1984 and is headquartered in Brookfield, WI.",
        "peratio": 29.34,
        "expectedpe": 127.52,
        "expectedpeg": "87.03 - 119.48",
        "dividendYield": "0.00 x 900",
        "totalLiabilities": 3155432,
        "debtEquity": 0.86,
        "totalCurrentAssets": "0.00 x 900",
        "totalCurrentLiab": "116.76 - 117.60",
        "currentRatio": 3.99
    },
    {
        "ticker": "FAST",
        "exchange": "NASDAQ",
        "sector": "Industrials",
        "type": "Stock",
        "industry": "Industrial Distribution",
        "description": "Fastenal Co. engages in the distribution of fasteners and tools. It also operates hardware stores. The company was founded by Robert A. Kierlin, Michael M. Gostomski, Henry K. McCannon, John D. Remick, and Stephen M. Slaggie in November 1967 and is headquartered in Winona, MN.",
        "peratio": 28.02,
        "expectedpe": 50.59,
        "expectedpeg": "43.73 - 60.74",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 3371133,
        "debtEquity": 1.17,
        "totalCurrentAssets": "0.00 x 1000",
        "totalCurrentLiab": "52.42 - 53.00",
        "currentRatio": 1.89
    },
    {
        "ticker": "EA",
        "exchange": "NASDAQ",
        "sector": "Communication Services",
        "type": "Stock",
        "industry": "Electronic Gaming & Multimedia",
        "description": "Electronic Arts, Inc. develops, markets, publishes, and distributes games, content, and services for game consoles, PCs, mobile phones, and tablets worldwide. The company develops and publishes games and services across various genres, such as sports, first-person shooter, action, role-playing, and simulation primarily under the Battlefield, The Sims, Apex Legends, Anthem, Need for Speed, and Plants v. Zombies brands, and license games, including FIFA, Madden NFL, and Star Wars brands. The firm also provides advertising services and licenses its games to third parties to distribute and host its games. It markets and sells its games and services through digital distribution channels, as well as through retail channels, such as mass-market retailers, electronics specialty stores, and game software specialty stores. The company was founded by William M. Hawkins III and William Gordon in 1982 and is headquartered in Redwood City, CA.",
        "peratio": 30.26,
        "expectedpe": 131.84,
        "expectedpeg": "109.24 - 142.79",
        "dividendYield": "0.00 x 1000",
        "totalLiabilities": 2386284,
        "debtEquity": 0.85,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "111.79 - 112.52",
        "currentRatio": 3.71
    },
    {
        "ticker": "CSCO",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Communication Equipment",
        "description": "Cisco Systems, Inc. engages in the design, manufacture, and sale of Internet Protocol-based networking products and services related to the communications and information technology industry. The firm operates through the following geographical segments: the Americas, EMEA, and APJC. Its products include the following categories: Switches, Routers, Wireless, Network Management Interfaces and Modules, Optical Networking, Access Points, Outdoor and Industrial Access Points, Next-Generation Firewalls, Advanced Malware Protection, VPN Security Clients, Email, and Web Security. The company was founded by Sandra Lerner and Leonard Bosack on December 10, 1984 and is headquartered in San Jose, CA.",
        "peratio": 17.99,
        "expectedpe": 57,
        "expectedpeg": "38.60 - 56.94",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 18259405,
        "debtEquity": 0.98,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "48.74 - 49.26",
        "currentRatio": 2.73
    },
    {
        "ticker": "REGN",
        "exchange": "NASDAQ",
        "sector": "Healthcare",
        "type": "Stock",
        "industry": "Biotechnology",
        "description": "Regeneron Pharmaceuticals, Inc. is a biotechnology company, which engages in the discovery, invention, development, manufacture, and commercialization of medicines. Its product portfolio includes the following brands: EYLEA, Dupixent, Praluent, Kevzara, Libtayo, ARCALYST, and ZALTRAP. The firm accelerates the traditional drug development process through its proprietary VelociSuite technologies such as VelocImmune, which uses unique genetically-humanized mice to produce optimized fully-human antibodies and bispecific antibodies. The company was founded by Alferd G. Gilman, Leonard S. Schleifer, and Eric M. Shooter on January 8, 1988, and is headquartered in Tarrytown, NY.",
        "peratio": 19.65,
        "expectedpe": 839.43,
        "expectedpeg": "538.01 - 800.48",
        "dividendYield": "0.00 x 4000",
        "totalLiabilities": 625966,
        "debtEquity": 0.21,
        "totalCurrentAssets": "0.00 x 1000",
        "totalCurrentLiab": "744.00 - 774.13",
        "currentRatio": 37.92
    },
    {
        "ticker": "IDXX",
        "exchange": "NASDAQ",
        "sector": "Healthcare",
        "type": "Stock",
        "industry": "Diagnostics & Research",
        "description": "IDEXX Laboratories, Inc. engages in the development, manufacture, and distribution of products and services for the animal veterinary, livestock and poultry, dairy and water testing markets. It operates through the following segments: Companion Animal Group (CAG), Water, Livestock, Poultry and Dairy (LPD), and Other. The CAG segment provides diagnostic and information management-based products and services for the companion animal veterinary industry, including in-clinic diagnostic solutions, outside reference laboratory services, and veterinary software and services. The Water segment offers innovative testing solutions for easy, rapid, and accurate detection and quantification of various microbiological parameters in water. The LPD segment develops diagnostic tests, services, and related instrumentation that are used to manage the health status of livestock and poultry, to improve producer efficiency, and to ensure the quality and safety of milk and food. The Other segment is composed of products for the human point-of-care medical diagnostics market with its out-licensing arrangements. The company was founded by David Evans Shaw on December 19, 1983, and is headquartered in Westbrook, ME.",
        "peratio": 58.03,
        "expectedpe": 554.25,
        "expectedpeg": "317.06 - 560.92",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 499505,
        "debtEquity": 1.18,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "474.09 - 482.50",
        "currentRatio": 8.31
    },
    {
        "ticker": "VRTX",
        "exchange": "NASDAQ",
        "sector": "Healthcare",
        "type": "Stock",
        "industry": "Biotechnology",
        "description": "Vertex Pharmaceuticals, Inc. is a global biotechnology company, which engages in the business of discovering, developing, manufacturing, and commercializing small molecule drugs for patients with serious diseases. The firm focuses on development and commercializing therapies for the treatment of cystic fibrosis, infectious diseases including viral infections such as influenza and bacterial infections, autoimmune diseases such as rheumatoid arthritis, cancer, inflammatory bowel disease and neurological disorders including pain and multiple sclerosis. The company was founded by Joshua S. Boger in 1989 and is headquartered in Boston, MA.",
        "peratio": 22.37,
        "expectedpe": 332.75,
        "expectedpeg": "233.01 - 325.19",
        "dividendYield": "0.00 x 1200",
        "totalLiabilities": 1323396,
        "debtEquity": 0.48,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "283.60 - 287.11",
        "currentRatio": 12.75
    },
    {
        "ticker": "BIIB",
        "exchange": "NASDAQ",
        "sector": "Healthcare",
        "type": "Stock",
        "industry": "Drug Manufacturers—General",
        "description": "Biogen, Inc. is a biopharmaceutical company, which engages in discovering, developing, and delivering therapies for neurological and neurodegenerative diseases. Its products include TECFIDERA, VUMERITY, AVONEX, PLEGRIDY, TYSABRI and FAMPYRA for the treatment of MS, SPINRAZA for the treatment of SMA, ADUHELM for the treatment of Alzheimer's disease, and FUMADERM for the treatment of severe plaque psoriasis. The company was founded by Charles Weissmann, Heinz Schaller, Kenneth Murray, Walter Gilbert, and Phillip Allen Sharp in 1978 and is headquartered in Cambridge, MA.",
        "peratio": 12.86,
        "expectedpe": 320.78,
        "expectedpeg": "187.16 - 311.88",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 1022713,
        "debtEquity": 0.19,
        "totalCurrentAssets": "0.00 x 1000",
        "totalCurrentLiab": "261.72 - 265.75",
        "currentRatio": 20.45
    },
    {
        "ticker": "ODFL",
        "exchange": "NASDAQ",
        "sector": "Industrials",
        "type": "Stock",
        "industry": "Trucking",
        "description": "Old Dominion Freight Line, Inc. engages in the provision of less-than-truckload services. The firm offers regional, inter-regional, and national less-than-truckload services. Its services also include container drayage, truckload brokerage, supply chain consulting, and warehousing. The company was founded by Earl Congdon Sr. and Lillian Congdon in 1934 and is headquartered in Thomasville, NC.",
        "peratio": 28.72,
        "expectedpe": 353.47,
        "expectedpeg": "231.31 - 381.81",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 821466,
        "debtEquity": 1.08,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "345.20 - 351.94",
        "currentRatio": 12.2
    },
    {
        "ticker": "GILD",
        "exchange": "NASDAQ",
        "sector": "Healthcare",
        "type": "Stock",
        "industry": "Drug Manufacturers—General",
        "description": "Gilead Sciences, Inc. is a biopharmaceutical company, which engages in the research, development, and commercialization of medicines in areas of unmet medical need. The firm's primary areas of focus include human immunodeficiency virus, acquired immunodeficiency syndrome, liver diseases, hematology, oncology, and inflammation and respiratory diseases. It offers antiviral products under Harvoni, Genvoya, Epclusa, Truvada, Atripla, Descovy, Stribild, Viread, Odefsey, Complera/Eviplera, Sovaldi, and Vosevi brands. The company was founded by Michael L. Riordan on June 22, 1987 and is headquartered in Foster City, CA.",
        "peratio": 22.03,
        "expectedpe": 89.92,
        "expectedpeg": "57.17 - 89.74",
        "dividendYield": "0.00 x 1100",
        "totalLiabilities": 6600357,
        "debtEquity": 0.4,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "79.82 - 80.83",
        "currentRatio": 3.64
    },
    {
        "ticker": "SNPS",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Software—Infrastructure",
        "description": "Synopsys, Inc. engages in the provision of software products and consulting services in the electronic design automation industry. It operates through the following segments: Semiconductor and System Design, and Software Integrity. The Semiconductor and System Design segment includes the EDA, IP and System Integration. The Software Integrity segment helps organizations align people, processes, and technology to intelligently address software risks across their portfolio and at all stages of the application lifecycle. The company was founded by Aart J. de Geus, Bill Krieger, Dave Gregory, and Rick Rudell in December 1986 and is headquartered in Mountain View, CA.",
        "peratio": 59.91,
        "expectedpe": 427.64,
        "expectedpeg": "255.02 - 391.17",
        "dividendYield": "0.00 x 1000",
        "totalLiabilities": 797222,
        "debtEquity": 1.18,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "360.66 - 370.11",
        "currentRatio": 6.16
    },
    {
        "ticker": "SIRI",
        "exchange": "NASDAQ",
        "sector": "Communication Services",
        "type": "Stock",
        "industry": "Entertainment",
        "description": "Sirius XM Holdings, Inc. engages in the provision of audio entertainment. It operates through Sirius XM and Pandora and Off-Platform segments. The company was founded on May 17, 1990, and is headquartered in New York, NY.",
        "peratio": 12.45,
        "expectedpe": 5.59,
        "expectedpeg": "3.8300 - 6.8500",
        "dividendYield": "0.0000 x 40000",
        "totalLiabilities": 15883408,
        "debtEquity": 0.97,
        "totalCurrentAssets": "0.0000 x 42300",
        "totalCurrentLiab": "3.8300 - 4.0750",
        "currentRatio": 0.31
    },
    {
        "ticker": "INTU",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Software—Application",
        "description": "Intuit, Inc. engages in the provision of business and financial management solutions. It operates through the following segments: Small Business and Self-Employed, Consumer, Credit Karma, and ProConnect. The Small Business and Self-Employed segment offers QuickBooks financial and business management online services and desktop software, payroll solutions, payment processing solutions, and financing for small businesses. The Consumer segment includes do-it-yourself and assisted TurboTax income tax preparation products and services. The Credit Karma segment serves consumers with a personal finance platform that provides personalized recommendations of credit card, home, auto and personal loan, and insurance products, and online savings and checking accounts. The ProConnect segment serves professional accountants in the U.S. and Canada, who are essential to both small business success and tax preparation and filing. The company was founded by Scott D. Cook and Thomas A. Proulx in March 1983 and is headquartered in Mountain View, CA.",
        "peratio": 60.83,
        "expectedpe": 483.95,
        "expectedpeg": "339.36 - 507.71",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 1522889,
        "debtEquity": 1.16,
        "totalCurrentAssets": "0.00 x 1000",
        "totalCurrentLiab": "408.00 - 418.17",
        "currentRatio": 6.85
    },
    {
        "ticker": "MCHP",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Semiconductors",
        "description": "Microchip Technology, Inc. engages in the provision of semiconductor products. It operates through the Semiconductor Products and Technology Licensing segments. The Semiconductor Products segment is involved in designing, developing, manufacturing, and marketing microcontrollers, development tools and analog, interface, mixed signal, connectivity devices, and timing products. The Technology Licensing segment offers license fees and royalties associated with technology licenses for the use of SuperFlash embedded flash and Smartbits one-time programmable technologies. The company was founded on February 14, 1989, and is headquartered in Chandler, AZ.",
        "peratio": 22.84,
        "expectedpe": 95.14,
        "expectedpeg": "54.33 - 87.76",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 4679745,
        "debtEquity": 1.57,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "82.57 - 84.64",
        "currentRatio": 3.7
    },
    {
        "ticker": "ORLY",
        "exchange": "NASDAQ",
        "sector": "Consumer Cyclical",
        "type": "Stock",
        "industry": "Specialty Retail",
        "description": "O'Reilly Automotive, Inc. owns and operates retail outlets in the United States. It engages in the distribution and retailing of automotive aftermarket parts, tools, supplies, equipment, and accessories in the U.S., serving both professional installers and do-it-yourself customers. The company provides new and remanufactured automotive hard parts, including alternators, starters, fuel pumps, water pumps, brake system components, batteries, belts, hoses, temperature controls, chassis parts and engine parts, maintenance items consisting of oil, antifreeze products, fluids, filters, lighting products, engine additives, and appearance products, and accessories, such as floor mats, seat covers, and truck accessories. Its stores offer auto body paint and related materials, automotive tools, and professional service provider service equipment. The company stores also offer enhanced services and programs consisting of used oil, oil filter and battery recycling, battery, wiper, and bulb replacement, battery diagnostic testing, electrical and module testing, check engine light code extraction, a loaner tool program, drum and rotor resurfacing, custom hydraulic hoses, professional paint shop mixing and related materials, and machine shops. Its stores provide do-it-yourself and professional service provider customers a selection of brand name, house brands, and private label products for domestic and imported automobiles, vans, and trucks. O'Reilly Automotive was founded by Charles F. O'Reilly and Charles H. O'Reilly, Sr. in November 1957 and is headquartered in Springfield, MO.",
        "peratio": 25.18,
        "expectedpe": 901.35,
        "expectedpeg": "562.90 - 873.94",
        "dividendYield": "0.00 x 900",
        "totalLiabilities": 479247,
        "debtEquity": 0.88,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "824.30 - 833.00",
        "currentRatio": 32.98
    },
    {
        "ticker": "DLTR",
        "exchange": "NASDAQ",
        "sector": "Consumer Defensive",
        "type": "Stock",
        "industry": "Discount Stores",
        "description": "Dollar Tree, Inc. owns and operates discount variety stores offering merchandise at fixed prices. It operates through the Dollar Tree and Family Dollar segments. The Dollar Tree segment includes operations under Dollar Tree and Dollar Tree Canada brands, with its distribution centers in the United States and Canada. The Family Dollar segment consists of a chain of general merchandise retail discount stores providing consumers with a selection of competitively priced merchandise in convenient neighborhood stores. The company was founded by J. Douglas Perry and Macon F. Brock, Jr. in 1953 and is headquartered in Chesapeake, VA.",
        "peratio": 20.19,
        "expectedpe": 161.49,
        "expectedpeg": "124.76 - 177.19",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 2120445,
        "debtEquity": 0.68,
        "totalCurrentAssets": "0.00 x 1000",
        "totalCurrentLiab": "140.25 - 142.24",
        "currentRatio": 7.02
    },
    {
        "ticker": "ANSS",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Software—Application",
        "description": "ANSYS, Inc. engages in the development and marketing of engineering simulation software and services. It operates through the following geographical segments: Americas, Europe, Middle East and Africa, and Asia-Pacific. The firm's solutions include automotive, aerospace and defense, construction, energy, materials and chemical processing, autonomous engineering, and electrification. The company was founded by John A. Swanson in 1970 and is headquartered in Canonsburg, PA.",
        "peratio": 49.05,
        "expectedpe": 308.08,
        "expectedpeg": "194.23 - 328.94",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 490227,
        "debtEquity": 1.24,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "299.97 - 304.53",
        "currentRatio": 6.17
    },
    {
        "ticker": "CTSH",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Information Technology Services",
        "description": "Cognizant Technology Solutions Corp. engages in the provision of information technology, consulting, and business process outsourcing services. It operates through the following business segments: Financial Services, Healthcare, Products and Resources, and Communications, Media, and Technology. The Financial Services segment consists of banking and insurance services. The Healthcare segment involves healthcare and life sciences. The Products and Resources segment consists of retail and consumer goods, manufacturing and logistics, travel and hospitality, and energy and utilities. The Communications, Media, and Technology segment includes communications, information, media and entertainment, and technology. The company was founded by Wijeyaraj Kumar Mahadeva and Francisco D'Souza in 1994 and is headquartered in Teaneck, NJ.",
        "peratio": 13.95,
        "expectedpe": 65.55,
        "expectedpeg": "51.33 - 93.47",
        "dividendYield": "0.00 x 1000",
        "totalLiabilities": 4746671,
        "debtEquity": 1.11,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "61.19 - 61.96",
        "currentRatio": 4.41
    },
    {
        "ticker": "CSGP",
        "exchange": "NASDAQ",
        "sector": "Real Estate",
        "type": "Stock",
        "industry": "Real Estate Services",
        "description": "CoStar Group, Inc. provides commercial real estate information, analytics, and online marketplaces to the commercial real estate and related business communities. The firm’s suite of online services enables clients to analyze, interpret and gain unmatched insight on commercial property values and market conditions. Its brands include CoStar, which is the largest provider of CRE research and real-time data, LoopNet, which is the most heavily trafficked mobile and online real estate marketplace, Apartments.com, which is the rental home resource for renters, property managers and owners, STR, which provides performance benchmarking and comparative analytics to the hotel industry, BizBuySell, which is the online marketplace for businesses-for-sales, and Lands of America, which is the operator of online marketplaces for rural real estate. The company was founded by Andrew C. Florance and Michael R. Klein in 1987 and is headquartered in Washington, DC.",
        "peratio": 77.32,
        "expectedpe": 84.25,
        "expectedpeg": "53.51 - 85.37",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 2503227,
        "debtEquity": 0.88,
        "totalCurrentAssets": "0.00 x 900",
        "totalCurrentLiab": "70.04 - 71.00",
        "currentRatio": 0.91
    },
    {
        "ticker": "EBAY",
        "exchange": "NASDAQ",
        "sector": "Consumer Cyclical",
        "type": "Stock",
        "industry": "Internet Retail",
        "description": "eBay, Inc. operates as a commerce company. The company platforms include online marketplace and its localized counterparts, including off-platform businesses in South Korea, Japan, and Turkey, as well as eBay’s suite of mobile apps. The company technologies and services are designed to give buyers choice and a breadth of relevant inventory and to enable sellers worldwide to organize and offer their inventory for sale, virtually anytime and anywhere. The company was founded by Pierre M. Omidyar in September 1995 and is headquartered in San Jose, CA.",
        "peratio": "nan",
        "expectedpe": 48.21,
        "expectedpeg": "35.92 - 60.39",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 4923581,
        "debtEquity": 1.36,
        "totalCurrentAssets": "0.00 x 1000",
        "totalCurrentLiab": "43.16 - 44.33",
        "currentRatio": -2.28
    },
    {
        "ticker": "BKNG",
        "exchange": "NASDAQ",
        "sector": "Consumer Cyclical",
        "type": "Stock",
        "industry": "Travel Services",
        "description": "Booking Holdings, Inc. engages in the provision of online travel and related solutions. The company offers services through the following brands: Booking.com, KAYAK, Priceline, Agoda, Rentalcars.com, and OpenTable. It provides accommodation reservations including hotels, hostels, apartments, vacation rentals, and other properties. The company was founded by Jay Scott Walker on July 18, 1997, and is headquartered in Norwalk, CT.",
        "peratio": 33.05,
        "expectedpe": 2715,
        "expectedpeg": "1,616.85 - 2,630.00",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 321345,
        "debtEquity": 1.31,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "2,563.69 - 2,598.98",
        "currentRatio": 78.14
    },
    {
        "ticker": "ISRG",
        "exchange": "NASDAQ",
        "sector": "Healthcare",
        "type": "Stock",
        "industry": "Medical Instruments & Supplies",
        "description": "Intuitive Surgical, Inc. engages in the provision of robotic-assisted surgical solutions and invasive care through a comprehensive ecosystem of products and services. Its products include Da Vinci Surgical and Ion Endoluminal systems. The company was founded by Frederic H. Moll, John Gordon Freund, and Robert G. Younge in November 1995 and is headquartered in Sunnyvale, CA.",
        "peratio": 61.13,
        "expectedpe": 279,
        "expectedpeg": "180.07 - 308.97",
        "dividendYield": "0.00 x 1000",
        "totalLiabilities": 1781288,
        "debtEquity": 1.29,
        "totalCurrentAssets": "0.00 x 1200",
        "totalCurrentLiab": "228.05 - 231.71",
        "currentRatio": 3.78
    },
    {
        "ticker": "MRVL",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Semiconductors",
        "description": "Marvell Technology, Inc. engages in the provision of data infrastructure semiconductor solutions. It offers compute, networking, storage, and custom solutions. The firm designs, develops, and sells integrated circuits. The company was founded by Wei Li Dai, Pantas Sutardja, and Sehat Sutardja in 1995 and is headquartered in Wilmington, DE.",
        "peratio": "nan",
        "expectedpe": 57.42,
        "expectedpeg": "33.75 - 76.59",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 11431891,
        "debtEquity": 1.47,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "41.08 - 43.18",
        "currentRatio": -0.2
    },
    {
        "ticker": "ILMN",
        "exchange": "NASDAQ",
        "sector": "Healthcare",
        "type": "Stock",
        "industry": "Diagnostics & Research",
        "description": "Illumina, Inc. engages in the development, manufacturing, and marketing of life science tools and integrated systems for large-scale analysis of genetic variation and function. It operates through the Core Illumina segment, which serves customers in the research, clinical and applied markets fields, and enables the adoption of a variety of genomic solutions. The firm's products include instruments, kits and reagents, selection tools, and software and analysis. Its services include sequencing and microarray services, proactive instrument monitoring, and instrument services, training, and consulting. The company was founded by David R. Walt, John R. Stuelpnagel, Anthony W. Czarnik, Lawrence A. Bock, and Mark S. Chee in April 1998 and is headquartered in San Diego, CA.",
        "peratio": "nan",
        "expectedpe": 235.32,
        "expectedpeg": "173.45 - 371.16",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 1302833,
        "debtEquity": 1.15,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "205.00 - 211.27",
        "currentRatio": -27.08
    },
    {
        "ticker": "ADI",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Semiconductors",
        "description": "Analog Devices, Inc. is a global high-performance semiconductor company, which engages in the design, development, manufacture, and marketing of integrated circuits (ICs). It produces a range of innovative products, including data converters, amplifiers and linear products, radio frequency (RF) ICs, power management products, sensors based on micro electromechanical systems (MEMS) technology and other sensors, and processing products, including DSP and other processors. The company was founded by Raymond P. Stata and Matthew Lorber in 1965 and is headquartered in Wilmington, MA.",
        "peratio": 28.27,
        "expectedpe": 216.81,
        "expectedpeg": "133.48 - 196.41",
        "dividendYield": "0.00 x 1000",
        "totalLiabilities": 3310091,
        "debtEquity": 1.14,
        "totalCurrentAssets": "0.00 x 900",
        "totalCurrentLiab": "185.21 - 187.45",
        "currentRatio": 6.6
    },
    {
        "ticker": "AEP",
        "exchange": "NASDAQ",
        "sector": "Utilities",
        "type": "Stock",
        "industry": "Utilities—Regulated Electric",
        "description": "American Electric Power Co., Inc. engages in the generation, transmission, and distribution of electricity. It operates through the following segments: Vertically Integrated Utilities, Transmission and Distribution Utilities, AEP Transmission Holdco, and Generation and Marketing. The Vertically Integrated Utilities segment covers the generation, transmission, and distribution of electricity for sale to retail and wholesale customers. The Transmission and Distribution Utilities segment represents the transmission and distribution of electricity for sale to retail and wholesale customers. The AEP Transmission Holdco segment comprised of the development, construction, and operation of transmission facilities through investments in its wholly-owned transmission subsidiaries and joint ventures. The Generation and Marketing segment consists of the non-regulated generation and marketing, risk management, and retail activities. The company was founded on December 20, 1906 and is headquartered in Columbus, OH.",
        "peratio": 19.89,
        "expectedpe": 103,
        "expectedpeg": "80.30 - 105.60",
        "dividendYield": "0.00 x 900",
        "totalLiabilities": 2781484,
        "debtEquity": 0.44,
        "totalCurrentAssets": "0.00 x 900",
        "totalCurrentLiab": "88.32 - 89.67",
        "currentRatio": 4.49
    },
    {
        "ticker": "CDNS",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Software—Application",
        "description": "Cadence Design Systems, Inc. engages in the design and development of integrated circuits and electronic devices. Its products include electronic design automation, software, emulation hardware, and intellectual property, commonly referred to as verification IP, and design IP. It operates through the following geographical segments: United States, Other Americas, China, Other Asia, Europe, Middle East and Africa and Japan. The company was founded by Alberto Sangiovanni-Vincentelli, Gudmundur A. Hjartarson, K. Bobby Chao, and K. Charles Janac in June 1988 and is headquartered in San Jose, CA.",
        "peratio": 63.67,
        "expectedpe": 214.29,
        "expectedpeg": "132.32 - 202.96",
        "dividendYield": "0.00 x 1000",
        "totalLiabilities": 1471693,
        "debtEquity": 1.07,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "195.17 - 199.46",
        "currentRatio": 3.13
    },
    {
        "ticker": "CSX",
        "exchange": "NASDAQ",
        "sector": "Industrials",
        "type": "Stock",
        "industry": "Railroads",
        "description": "CSX Corp. engages in the provision of rail-based freight transportation services. Its services include rail service, the transport of intermodal containers and trailers, rail-to-truck transfers and bulk commodity operations. The company was founded in 1827 and is headquartered in Jacksonville, FL.",
        "peratio": 15.52,
        "expectedpe": 34.4,
        "expectedpeg": "25.80 - 38.17",
        "dividendYield": "0.00 x 1400",
        "totalLiabilities": 13335581,
        "debtEquity": 1.22,
        "totalCurrentAssets": "0.00 x 1100",
        "totalCurrentLiab": "29.76 - 30.39",
        "currentRatio": 1.95
    },
    {
        "ticker": "HON",
        "exchange": "NASDAQ",
        "sector": "Industrials",
        "type": "Stock",
        "industry": "Conglomerates",
        "description": "Honeywell International, Inc. is a software industrial company, which offers industry specific solutions to aerospace and automotive products and services. It specializes in turbochargers control, sensing and security technologies for buildings and homes, specialty chemicals, electronic and advanced materials, process technology for refining and petrochemicals, and energy efficient products and solutions for homes, business, and transportation. It operates through the following segments: Aerospace, Home and Building Technologies, Performance Materials and Technologies, and Safety and Productivity Solutions. The company was founded by Albert M. Butz in 1906 and is headquartered in Charlotte, NC.",
        "peratio": 26.86,
        "expectedpe": 218.63,
        "expectedpeg": "166.63 - 220.96",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 3057732,
        "debtEquity": 1.11,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "194.13 - 196.65",
        "currentRatio": 7.28
    },
    {
        "ticker": "XEL",
        "exchange": "NASDAQ",
        "sector": "Utilities",
        "type": "Stock",
        "industry": "Utilities—Regulated Electric",
        "description": "Xcel Energy, Inc. operates as a holding company engaged in the generation, purchase, transmission, distribution, and sale of electricity. It operates through the following three segments: Regulated Electric Utility, Regulated Natural Gas Utility and All Others. The Regulated Electric Utility segment generates, transmits, and distributes electricity primarily in Minnesota, Wisconsin, Michigan, North Dakota, South Dakota, Colorado, Texas, and New Mexico. In addition, this segment includes sales for resale and provides wholesale transmission service to various entities in the United States. It also includes commodity trading operations. The Regulated Natural Gas Utility segment transports, stores, and distributes natural gas primarily in portions of Minnesota, Wisconsin, North Dakota, Michigan, and Colorado. The All Others segment engages in steam, appliance repair services, nonutility real estate activities, processing solid waste into refuse-derived fuel and investments in rental housing projects that qualify for low-income housing tax credits. The company was founded in 1909 and is headquartered in Minneapolis, MN.",
        "peratio": 20.32,
        "expectedpe": 73.75,
        "expectedpeg": "56.89 - 77.66",
        "dividendYield": "0.00 x 900",
        "totalLiabilities": 2596022,
        "debtEquity": 0.42,
        "totalCurrentAssets": "0.00 x 900",
        "totalCurrentLiab": "63.57 - 64.53",
        "currentRatio": 3.17
    },
    {
        "ticker": "EXC",
        "exchange": "NASDAQ",
        "sector": "Utilities",
        "type": "Stock",
        "industry": "Utilities—Regulated Electric",
        "description": "Exelon Corp. is a utility services holding company, which engages in the energy distribution and transmission businesses. It operates through the following segments: Commonwealth Edison Company (ComEd), PECO Energy Company (PECO), Baltimore Gas and Electric Company (BGE), Potomac Electric Power Company (Pepco), Delmarva Power & Light Company (DPL), and Atlantic City Electric Company (ACE). The company was founded in February 1999 and is headquartered in Chicago, IL.",
        "peratio": 19.83,
        "expectedpe": 46.25,
        "expectedpeg": "35.19 - 50.71",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 6684410,
        "debtEquity": 0.59,
        "totalCurrentAssets": "0.00 x 1300",
        "totalCurrentLiab": "40.76 - 41.36",
        "currentRatio": 2.08
    },
    {
        "ticker": "PEP",
        "exchange": "NASDAQ",
        "sector": "Consumer Defensive",
        "type": "Stock",
        "industry": "Beverages—Non-Alcoholic",
        "description": "PepsiCo, Inc. engages in the manufacture, marketing, distribution, and sale of beverages, food, and snacks. It operates through the following business segments: Frito-Lay North America (FLNA), Quaker Foods North America (QFNA), PepsiCo Beverages North America (PBNA), Latin America (LatAm), Europe, Africa, Middle East, and South Asia (AMESA), and Asia Pacific, Australia and New Zealand, and China Region (APAC). The FLNA segment consists of branded convenient food businesses in the United States and Canada. The QFNA segment includes cereals, rice, and pasta under the Quaker, Pearl Milling Company, Quaker Chewy, Cap'n Crunch, Life, and Rice-A-Roni brands. The PBNA segment is composed of beverage concentrates, fountain syrups, and finished goods under various beverage brands such as Pepsi, Gatorade, Mountain Dew, Diet Pepsi, Aquafina, Diet Mountain Dew, Sierra Mist, and Mug. The LatAm segment covers beverage, food, and snack businesses in the Latin American region. The Europe segment offers beverage, food, and snack goods in Europe and Sub-Saharan Africa regions. The AMESA segment deals with all beverage and convenient food businesses in Africa, the Middle East, and South Asia. The APAC segment refers to all business operations in the Asia Pacific, Australia and New Zealand, and China region. The company was founded by Donald M. Kendall, Sr. and Herman W. Lay in 1965 and is headquartered in Purchase, NY.",
        "peratio": 26.96,
        "expectedpe": 189.5,
        "expectedpeg": "153.37 - 186.84",
        "dividendYield": "0.00 x 1000",
        "totalLiabilities": 4749408,
        "debtEquity": 0.54,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "171.78 - 173.35",
        "currentRatio": 6.42
    },
    {
        "ticker": "WBA",
        "exchange": "NASDAQ",
        "sector": "Healthcare",
        "type": "Stock",
        "industry": "Pharmaceutical Retailers",
        "description": "Walgreens Boots Alliance, Inc. engages in the provision of healthcare and retail pharmacy services. It operates through the following segments: United States Retail Pharmacy, International, and United States Healthcare. The US Retail Pharmacy segment includes the operation of retail drugstores, health and wellness services, specialty and home delivery pharmacy services, and equity method investment. The International segment offers pharmacy-led health and beauty retail businesses outside the US and the pharmaceutical wholesaling and distribution business in Germany. The US Healthcare segment delivers improved health outcomes and lower costs for payors and providers through owned and partnered assets. The company was founded by Charles R. Walgreen and John Boot in 1901 and is headquartered in Deerfield, IL.",
        "peratio": "nan",
        "expectedpe": 41.58,
        "expectedpeg": "30.39 - 48.97",
        "dividendYield": "0.00 x 1200",
        "totalLiabilities": 6301266,
        "debtEquity": 0.72,
        "totalCurrentAssets": "0.00 x 2200",
        "totalCurrentLiab": "34.14 - 34.54",
        "currentRatio": -3.43
    },
    {
        "ticker": "ALGN",
        "exchange": "NASDAQ",
        "sector": "Healthcare",
        "type": "Stock",
        "industry": "Medical Devices",
        "description": "Align Technology, Inc. engages in the design, manufacture, and market of orthodontics, restorative, and aesthetic dentistry products. It operates through the Clear Aligner, and Scanner and Services segments. The Clear Aligner segment consists of Invisalign full, teen, and assist products, and Vivera retainers for treating malocclusion. The Scanner and Services segment consists of intraoral scanning systems such as single hardware platforms and restorative or orthodontic software options, ancillary products, and other related additional services. The company was founded by Zia Chishti, Brian Freyburger, and Kelsey Wirth in March 1997 and is headquartered in Tempe, AZ.",
        "peratio": 72.39,
        "expectedpe": 336.22,
        "expectedpeg": "172.05 - 461.79",
        "dividendYield": "0.00 x 1000",
        "totalLiabilities": 1118352,
        "debtEquity": 1.6,
        "totalCurrentAssets": "0.00 x 1000",
        "totalCurrentLiab": "327.90 - 334.47",
        "currentRatio": 4.59
    },
    {
        "ticker": "SGEN",
        "exchange": "NASDAQ",
        "sector": "Healthcare",
        "type": "Stock",
        "industry": "Biotechnology",
        "description": "Seagen Inc. is a biotechnology company, which engages in the development and commercialization of targeted therapies for the treatment of cancer. It also engages in the advancement of therapies for solid tumors and blood-related cancers. Its products include Adcetris, Padcev, Tivdak, and Tukysa. The company was founded by Clay B. Siegall and H. Perry Fell on July 15, 1997 and is headquartered in Bothell, WA.",
        "peratio": "nan",
        "expectedpe": 174.25,
        "expectedpeg": "105.43 - 183.00",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 1155650,
        "debtEquity": 0.53,
        "totalCurrentAssets": "0.00 x 1000",
        "totalCurrentLiab": "174.72 - 177.51",
        "currentRatio": -3.28
    },
    {
        "ticker": "MDLZ",
        "exchange": "NASDAQ",
        "sector": "Consumer Defensive",
        "type": "Stock",
        "industry": "Confectioners",
        "description": "Mondelez International, Inc. engages in the manufacture and marketing of snack food and beverage products. It operates through the following geographical segments: Latin America, Asia, Middle East, and Africa, Europe, and North America. Its products include beverages, biscuits, chocolate, gum and candy, cheese and grocery, and meals. Its brands include, but are not limited to, Nabisco, Oreo, and LU biscuits, Cadbury, Cadbury Dairy Milk, and Milka chocolates, and Trident gum. The company was founded by James Lewis Kraft in 1903 is headquartered in Chicago, IL.",
        "peratio": 33.21,
        "expectedpe": 75.04,
        "expectedpeg": "54.72 - 68.81",
        "dividendYield": "0.00 x 900",
        "totalLiabilities": 5734018,
        "debtEquity": 0.66,
        "totalCurrentAssets": "0.00 x 1800",
        "totalCurrentLiab": "64.60 - 65.24",
        "currentRatio": 1.96
    },
    {
        "ticker": "NFLX",
        "exchange": "NASDAQ",
        "sector": "Communication Services",
        "type": "Stock",
        "industry": "Entertainment",
        "description": "Netflix, Inc. engages in providing entertainment services. It also offers a broad set of activities for leisure time, entertainment video, video gaming, and other sources of entertainment. It operates through the United States and International geographic segments. The company was founded by Marc Randolph and Wilmot Reed Hastings on August 29, 1997 and is headquartered in Los Gatos, CA.",
        "peratio": 31.53,
        "expectedpe": 354.49,
        "expectedpeg": "162.71 - 396.50",
        "dividendYield": "0.00 x 1000",
        "totalLiabilities": 8135018,
        "debtEquity": 1.26,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "305.80 - 311.83",
        "currentRatio": 9.89
    },
    {
        "ticker": "GOOGL",
        "exchange": "NASDAQ",
        "sector": "Communication Services",
        "type": "Stock",
        "industry": "Internet Content & Information",
        "description": "Alphabet, Inc. engages in the business of delivering online advertising, cloud-based solutions that provide enterprise customers with infrastructure and platform services, the provision of communication and collaboration tools, and sales of other products and services such as apps and in-app purchases, hardware, and subscription-based products. It operates under the Google Services and Google Cloud segments. The Google Services segment includes ads, Android, Chrome, hardware, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. The Google Cloud segment offers Google Cloud Platform and Google Workspace. The company was founded by Lawrence E. Page and Sergey Mikhaylovich Brin on October 2, 2015 and is headquartered in Mountain View, CA.",
        "peratio": 19.64,
        "expectedpe": 124.23,
        "expectedpeg": "83.34 - 143.79",
        "dividendYield": "0.00 x 1400",
        "totalLiabilities": 37806738,
        "debtEquity": 1.09,
        "totalCurrentAssets": "0.00 x 1000",
        "totalCurrentLiab": "94.00 - 95.96",
        "currentRatio": 4.8
    },
    {
        "ticker": "DXCM",
        "exchange": "NASDAQ",
        "sector": "Healthcare",
        "type": "Stock",
        "industry": "Medical Devices",
        "description": "DexCom, Inc. is a medical device manufacturing company, which engages in the design, development and commercialization of glucose monitoring systems for ambulatory use by people with diabetes. Its products include Dexcom G6 CGM System, DexCom G6 CGM System for Medicare, Software and Mobile apps. The company was founded by John F. Burd on May 1, 1999 and is headquartered in San Diego, CA.",
        "peratio": 139.19,
        "expectedpe": 132.74,
        "expectedpeg": "66.89 - 134.76",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 2594884,
        "debtEquity": 1.09,
        "totalCurrentAssets": "0.00 x 900",
        "totalCurrentLiab": "111.94 - 114.01",
        "currentRatio": 0.81
    },
    {
        "ticker": "TMUS",
        "exchange": "NASDAQ",
        "sector": "Communication Services",
        "type": "Stock",
        "industry": "Telecom Services",
        "description": "T-Mobile US, Inc. engages in the provision of wireless communications services under the T-Mobile and MetroPCS brands. It offers postpaid and prepaid wireless voice, messaging and data services, and wholesale wireless services. The company was founded in 1994 and is headquartered in Bellevue, WA.",
        "peratio": 69.5,
        "expectedpe": 178.13,
        "expectedpeg": "120.44 - 154.38",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 5183528,
        "debtEquity": 0.56,
        "totalCurrentAssets": "0.00 x 1200",
        "totalCurrentLiab": "142.31 - 144.04",
        "currentRatio": 2.06
    },
    {
        "ticker": "MELI",
        "exchange": "NASDAQ",
        "sector": "Consumer Cyclical",
        "type": "Stock",
        "industry": "Internet Retail",
        "description": "MercadoLibre, Inc. engages in the development of an online commerce platform with a focus on e-commerce and related services. It operates through the following geographical segments: Brazil, Argentina, Mexico, and Other Countries. The Other Countries segment includes Chile, Colombia, Costa Rica, Dominican Republic, Ecuador, Panama, Peru, Bolivia, Honduras, Nicaragua, El Salvador, Guatemala, Paraguay, Uruguay, and the United States of America. Its products provide a mechanism for buying, selling, and paying as well as collecting, generating leads, and comparing lists through e-commerce transactions. The company was founded by Marcos Eduardo Galperin on October 15, 1999 and is headquartered in Montevideo, Uruguay.",
        "peratio": 130.89,
        "expectedpe": 1402.89,
        "expectedpeg": "600.68 - 1,275.82",
        "dividendYield": "0.00 x 1000",
        "totalLiabilities": 564345,
        "debtEquity": 1.59,
        "totalCurrentAssets": "0.00 x 1000",
        "totalCurrentLiab": "1,230.32 - 1,265.00",
        "currentRatio": 9.57
    },
    {
        "ticker": "ATVI",
        "exchange": "NASDAQ",
        "sector": "Communication Services",
        "type": "Stock",
        "industry": "Electronic Gaming & Multimedia",
        "description": "Activision Blizzard, Inc. is a developer and publisher of interactive entertainment content and services. It operates through the following segments: Activision Publishing, Blizzard Entertainment, and King Digital Entertainment. The Activision Publishing segment delivers content through both premium and free-to-play offerings and generates revenue from full-game and in-game sales, as well as by licensing software to third-party or related-party companies that distribute Activision products. The Blizzard Entertainment segment is engaged in delivering content through both premium and free-to-play offerings and generates revenue from full-game and in-game sales, subscriptions, and by licensing software to third-party or related-party companies that distribute Blizzard products. The King Digital Entertainment segment is focused on delivering content through free-to-play offerings and generates revenue from in-game sales and in-game advertising on the mobile platform. The company was founded in 1979 and is headquartered in Santa Monica, CA.",
        "peratio": 41.4,
        "expectedpe": 91.59,
        "expectedpeg": "70.94 - 81.50",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 6046483,
        "debtEquity": 0.42,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "79.07 - 79.70",
        "currentRatio": 1.92
    },
    {
        "ticker": "AVGO",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Semiconductors",
        "description": "Broadcom, Inc. is a global technology company, which designs, develops, and supplies semiconductor and infrastructure software solutions. It operates through the Semiconductor Solutions and Infrastructure Software segments. The Semiconductor Solutions segment manages movement of data in data center, telecom, enterprise, and embedded networking applications. The Infrastructure Software segment provides a portfolio of mainframe, enterprise, and storage area networking solutions. The company was founded in 1961 and is headquartered in San Jose, CA.",
        "peratio": 21.3,
        "expectedpe": 671.43,
        "expectedpeg": "415.07 - 645.31",
        "dividendYield": "0.00 x 900",
        "totalLiabilities": 2284777,
        "debtEquity": 1.12,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "623.67 - 632.72",
        "currentRatio": 29.68
    },
    {
        "ticker": "VRSK",
        "exchange": "NASDAQ",
        "sector": "Industrials",
        "type": "Stock",
        "industry": "Consulting Services",
        "description": "Verisk Analytics, Inc. is a data analytics provider, which engages in the provision of data analytics for customers in insurance, energy markets and financial services. It operates through the following segments: Insurance, Energy & Specialized Markets, and Financial Services. The Insurance segment serves insurance customers and focuses on the prediction of loss, the selection and pricing of risk, and compliance. The Energy & Specialized Markets segment provides data analytics services. It also provides research and consulting services focusing on exploration strategies and screening, asset development and acquisition, commodity markets and corporate analysis. The Financial Services segment maintains bank account consortia to provide competitive benchmarking, decisioning algorithms, business intelligence, and customized analytic services to financial institutions, payment networks and processors, alternative lenders, regulators and merchants. The company was founded in 1971 and is headquartered in Jersey City, NJ.",
        "peratio": 28.27,
        "expectedpe": 196.86,
        "expectedpeg": "156.05 - 222.11",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 969149,
        "debtEquity": 0.84,
        "totalCurrentAssets": "0.00 x 1000",
        "totalCurrentLiab": "183.37 - 185.84",
        "currentRatio": 6.54
    },
    {
        "ticker": "FTNT",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Software—Infrastructure",
        "description": "Fortinet, Inc. provides cybersecurity solutions to a variety of businesses, such as enterprises, communication service providers and small businesses. It operates through the following segments: Network Security, Infrastructure Security, Cloud Security, and Endpoint Protection, Internet of Things and Operational Technology. The Network Security segment includes the majority of product sales from its FortiGate network security appliances. The Infrastructure Security segment provides a platform, which is an architectural approach that protects the entire digital attack surface, including network core, endpoints, applications, data centers and private and public clouds. Together with its network of Fabric-Ready Partners, the Fortinet Security Fabric platform enables disparate security devices to work together as an integrated, automated, and collaborative solution. The Cloud Security segment provides help to customers to connect securely to and across their cloud environments by offering security through its virtual firewall and other software products in public and private cloud environments. The Endpoint Protection, Internet of Things and Operational Technology segment includes the proliferation of Internet of Things (IoT) and an Operational Technology (OT). IoT and OT have created an environment where data moves freely between devices across locations, network environments, remote offices, mobile workers and public cloud environments, making the data difficult to consistently track and secure. The company was founded by Ken Xie and Michael Xie in October 2000 and is headquartered in Sunnyvale, CA.",
        "peratio": 59.41,
        "expectedpe": 69.32,
        "expectedpeg": "42.61 - 71.52",
        "dividendYield": "0.00 x 1200",
        "totalLiabilities": 5313167,
        "debtEquity": 1.14,
        "totalCurrentAssets": "0.00 x 1100",
        "totalCurrentLiab": "59.75 - 61.99",
        "currentRatio": 1.04
    },
    {
        "ticker": "CHTR",
        "exchange": "NASDAQ",
        "sector": "Communication Services",
        "type": "Stock",
        "industry": "Telecom Services",
        "description": "Charter Communications, Inc. engages in the provision of broadband communications services. Its services include Spectrum TV, Spectrum Internet, and Spectrum Voice. The firm offers business-to-business Internet access, data networking, business telephone, video and music entertainment services, and wireless backhaul. Its advertising sales division, Spectrum Reach, offers local, regional, and national businesses the opportunity to advertise in individual and multiple service areas on cable television networks and advanced advertising platforms. The company was founded in 1993 and is headquartered in Stamford, CT.",
        "peratio": 11.31,
        "expectedpe": 474.79,
        "expectedpeg": "297.66 - 583.72",
        "dividendYield": "0.00 x 1000",
        "totalLiabilities": 1376998,
        "debtEquity": 1.12,
        "totalCurrentAssets": "0.00 x 900",
        "totalCurrentLiab": "351.42 - 360.67",
        "currentRatio": 31.3
    },
    {
        "ticker": "NXPI",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Semiconductors",
        "description": "NXP Semiconductors NV is a holding company, which engages in the provision of semiconductor solutions. Its portfolio includes intellectual property, deep application knowledge, process technology and manufacturing expertise in the domains of cryptography-security, high-speed interface, radio frequency (RF), mixed-signal analog-digital, power management, digital signal processing, and embedded system design. Its product solutions are used in a wide range of end market applications including: automotive, industrial and Internet of Things (IoT), mobile, and communication infrastructure. It operates through the following geographical segments: China, Netherlands, United States, Singapore, Germany, Japan, South Korea, Malaysia, and Other Countries. The company was founded on August 2, 2006, and is headquartered in Eindhoven, the Netherlands.",
        "peratio": 17.55,
        "expectedpe": 195.35,
        "expectedpeg": "132.08 - 198.28",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 2027771,
        "debtEquity": 1.53,
        "totalCurrentAssets": "0.00 x 900",
        "totalCurrentLiab": "178.38 - 182.64",
        "currentRatio": 10.4
    },
    {
        "ticker": "ENPH",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Solar",
        "description": "Enphase Energy, Inc. is a global energy technology company, which engages in the design, development, manufacture, and sale of micro inverter systems for the solar photovoltaic industry. The firm’s products include IQ 7 Microinverter Series, IQ Battery, IQ Envoy, IQ Microinverter Accessories, IQ Envoy Accessories and Enlighten & Apps. It operates through the following geographical segments: United States, India, China, Mexico, New Zealand, Romania, and Other. The company was founded by Raghuveer R. Belur and Martin Fornage in March 2006 and is headquartered in Fremont, CA.",
        "peratio": 81.16,
        "expectedpe": 298.66,
        "expectedpeg": "128.67 - 339.92",
        "dividendYield": "0.00 x 1300",
        "totalLiabilities": 4131910,
        "debtEquity": 1.48,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "213.67 - 223.58",
        "currentRatio": 2.69
    },
    {
        "ticker": "META",
        "exchange": "NASDAQ",
        "sector": "Communication Services",
        "type": "Stock",
        "industry": "Internet Content & Information",
        "description": "Meta Platforms, Inc., engages in the development of social media applications. It builds technology that helps people connect, find communities, and grow businesses. It operates through the Family of Apps (FoA) and Reality Labs (RL) segments. The FoA segment consists of Facebook, Instagram, Messenger, WhatsApp, and other services. The RL segment includes augmented and virtual reality related consumer hardware, software, and content. The company was founded by Mark Elliot Zuckerberg, Dustin Moskovitz, Chris R. Hughes, Andrew McCollum, and Eduardo P. Saverin on February 4, 2004, and is headquartered in Menlo Park, CA.",
        "peratio": 20.37,
        "expectedpe": 208.74,
        "expectedpeg": "88.09 - 236.86",
        "dividendYield": "0.00 x 3000",
        "totalLiabilities": 32655600,
        "debtEquity": 1.18,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "181.34 - 185.26",
        "currentRatio": 9.08
    },
    {
        "ticker": "WDAY",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Software—Application",
        "description": "Workday, Inc. engages in the development of enterprise cloud applications for finance and human resources. It delivers financial management, human capital management and analytics applications designed for companies, educational institutions and government agencies. The company was founded by David A. Duffield and Aneel Bhusri in March 2005 and is headquartered in Pleasanton, CA.",
        "peratio": "nan",
        "expectedpe": 210.86,
        "expectedpeg": "128.72 - 248.92",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 2014337,
        "debtEquity": 1.26,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "182.86 - 187.17",
        "currentRatio": -1.39
    },
    {
        "ticker": "GOOG",
        "exchange": "NASDAQ",
        "sector": "Communication Services",
        "type": "Stock",
        "industry": "Internet Content & Information",
        "description": "Alphabet, Inc. engages in the business of delivering online advertising, cloud-based solutions that provide enterprise customers with infrastructure and platform services, the provision of communication and collaboration tools, and sales of other products and services such as apps and in-app purchases, hardware, and subscription-based products. It operates under the Google Services and Google Cloud segments. The Google Services segment includes ads, Android, Chrome, hardware, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. The Google Cloud segment offers Google Cloud Platform and Google Workspace. The company was founded by Lawrence E. Page and Sergey Mikhaylovich Brin on October 2, 2015 and is headquartered in Mountain View, CA.",
        "peratio": 19.64,
        "expectedpe": 123.8,
        "expectedpeg": "83.45 - 144.16",
        "dividendYield": "0.00 x 1000",
        "totalLiabilities": 30270877,
        "debtEquity": 1.09,
        "totalCurrentAssets": "0.00 x 1100",
        "totalCurrentLiab": "94.48 - 96.24",
        "currentRatio": 4.82
    },
    {
        "ticker": "JD",
        "exchange": "NASDAQ",
        "sector": "Consumer Cyclical",
        "type": "Stock",
        "industry": "Internet Retail",
        "description": "JD.com, Inc. is a technology-driven E-commerce company. It engages in the sale of electronics products and general merchandise products, including audio, video products, and books. It operates through the following segments: JD Retail, JD Logistics, and New Businesses. The JD Retail segment offers online retail, online marketplace, and marketing services. The JD Logistics segment includes internal and external logistics businesses. The New Businesses segment is composed of JD Property, Jingxi, overseas businesses and technology initiatives. The company was founded on June 18, 1998 by Qiang Dong Liu and is headquartered in Beijing, China.",
        "peratio": 261,
        "expectedpe": 79.78,
        "expectedpeg": "33.17 - 69.43",
        "dividendYield": "0.00 x 900",
        "totalLiabilities": 7705124,
        "debtEquity": 0.48,
        "totalCurrentAssets": "0.00 x 3000",
        "totalCurrentLiab": "45.47 - 47.41",
        "currentRatio": 0.18
    },
    {
        "ticker": "PYPL",
        "exchange": "NASDAQ",
        "sector": "Financial Services",
        "type": "Stock",
        "industry": "Credit Services",
        "description": "PayPal Holdings, Inc. engages in the development of technology platforms for digital payments. Its solutions include PayPal, PayPal Credit, Braintree, Venmo, Xoom, and Paydiant products. It manages a two-sided proprietary global technology platform that links customers, which consist of both merchants and consumers, to facilitate the processing of payment transactions. It allows its customers to use their account for both purchase and paying for goods, as well as to transfer and withdraw funds. It also enables consumers to exchange funds with merchants using funding sources, which include bank account, PayPal account balance, PayPal Credit account, credit and debit card or other stored value products. It offers consumers person-to-person payment solutions through its PayPal Website and mobile application, Venmo and Xoom. The company was founded in December 1998 and is headquartered in San Jose, CA.",
        "peratio": 34.79,
        "expectedpe": 100.95,
        "expectedpeg": "66.39 - 122.92",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 13649782,
        "debtEquity": 1.31,
        "totalCurrentAssets": "0.00 x 1100",
        "totalCurrentLiab": "74.35 - 76.20",
        "currentRatio": 2.18
    },
    {
        "ticker": "KHC",
        "exchange": "NASDAQ",
        "sector": "Consumer Defensive",
        "type": "Stock",
        "industry": "Packaged Foods",
        "description": "The Kraft Heinz Co. engages in the manufacture and market of food and beverage products. The firm operates through the following geographical segments: United States, Canada and International. Its brands include Oscar Meyer, Velveeta, Smart Ones, Caprisun, Kool-Aid, Golden circle and Honig. The company was founded on July 2, 2015, and is headquartered in Pittsburgh, PA.",
        "peratio": 20.06,
        "expectedpe": 42.95,
        "expectedpeg": "32.73 - 44.87",
        "dividendYield": "0.00 x 1400",
        "totalLiabilities": 6731839,
        "debtEquity": 0.7,
        "totalCurrentAssets": "0.00 x 3100",
        "totalCurrentLiab": "38.03 - 38.76",
        "currentRatio": 1.91
    },
    {
        "ticker": "TEAM",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Software—Application",
        "description": "Atlassian Corp. is a holding company, which engages in providing team collaboration and productivity software. Its software helps teams organize, discuss, and complete shared work. Its products include Jira Software, Confluence, Jira Service Management, and Trello. The company was founded by Michael Cannon-Brookes and Scott Farquhar in October 2002 and is headquartered in San Francisco, CA.",
        "peratio": "nan",
        "expectedpe": 199.32,
        "expectedpeg": "113.86 - 318.64",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 3190777,
        "debtEquity": 0.83,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "174.40 - 178.64",
        "currentRatio": -1.67
    },
    {
        "ticker": "BKR",
        "exchange": "NASDAQ",
        "sector": "Energy",
        "type": "Stock",
        "industry": "Oil & Gas Equipment & Services",
        "description": "Baker Hughes Co. is a holding company. The firm engages in the provision of oilfield products, services, and digital solutions. It operates through the following segments: Oilfield Services (OFS), Oilfield Equipment (OFE), Turbomachinery & Process Solutions (TPS) and Digital Solutions (DS). The OFS segment provides products and services for on and offshore operations across the lifecycle of a well, ranging from drilling, evaluation, completion, production, and intervention. The OFE segment provides a broad portfolio of products and services required to facilitate the safe and reliable flow of hydrocarbons from the subsea wellhead to the surface production facilities. The TPS segment provides equipment and related services for mechanical-drive, compression and power-generation applications. The DS segment provides operating technologies helping to improve the health, productivity, and safety of asset intensive industries and enable the Industrial Internet of Things. The company was founded in April 1987 and is headquartered in Houston, TX.",
        "peratio": "nan",
        "expectedpe": 37.1,
        "expectedpeg": "20.42 - 39.78",
        "dividendYield": "0.00 x 1300",
        "totalLiabilities": 6792428,
        "debtEquity": 1.45,
        "totalCurrentAssets": "0.00 x 1300",
        "totalCurrentLiab": "30.99 - 31.90",
        "currentRatio": -0.61
    },
    {
        "ticker": "ZS",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Software—Infrastructure",
        "description": "Zscaler, Inc. engages in the provision of a cloud-based internet security platform. It offers Zero Trust Exchange, Zscaler Client Connector, Zscaler Internet Access, Zscaler Private Access, Zscaler B2B, Zscaler Cloud Protection, and Zscaler Digital Experience. The company was founded by Jagtar Singh Chaudhry and K. Kailash in September 2007 and is headquartered in San Jose, CA.",
        "peratio": "nan",
        "expectedpe": 162.01,
        "expectedpeg": "99.64 - 253.74",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 2623803,
        "debtEquity": 0.88,
        "totalCurrentAssets": "0.00 x 900",
        "totalCurrentLiab": "113.86 - 118.62",
        "currentRatio": -2.42
    },
    {
        "ticker": "PDD",
        "exchange": "NASDAQ",
        "sector": "Consumer Cyclical",
        "type": "Stock",
        "industry": "Internet Retail",
        "description": "PDD Holdings, Inc. engages in multinational commerce which owns and operates a portfolio of businesses. Its portfolio includes Pinduoduo, a fresh agriculture platform; and Temu, an online marketplace that connects consumers with sellers, manufactures, and brands. The company was founded by Hua Lin Cai and Zheng Huang on April 20, 2015 and is headquartered in Shanghai, China.",
        "peratio": 32.3,
        "expectedpe": 106.93,
        "expectedpeg": "23.21 - 106.38",
        "dividendYield": "0.00 x 900",
        "totalLiabilities": 8141858,
        "debtEquity": 0.76,
        "totalCurrentAssets": "0.00 x 1100",
        "totalCurrentLiab": "91.86 - 93.66",
        "currentRatio": 2.88
    },
    {
        "ticker": "MRNA",
        "exchange": "NASDAQ",
        "sector": "Healthcare",
        "type": "Stock",
        "industry": "Biotechnology",
        "description": "Moderna, Inc. engages in the development of transformative medicines based on messenger ribonucleic acid (mRNA). Its product pipeline includes the following modalities: prophylactic vaccines, cancer vaccines, intratumoral immuno-oncology, localized regenerative therapeutics, systemic secreted therapeutics, and systemic intracellular therapeutics. The company was founded by Noubar B. Afeyan, Robert S. Langer, Jr., Derrick J. Rose and Kenneth R. Chien in 2010 and is headquartered in Cambridge, MA.",
        "peratio": 6.81,
        "expectedpe": 224.5,
        "expectedpeg": "115.03 - 217.25",
        "dividendYield": "0.00 x 1000",
        "totalLiabilities": 5089560,
        "debtEquity": 1.7,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "140.34 - 142.53",
        "currentRatio": 20.87
    },
    {
        "ticker": "CRWD",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Software—Infrastructure",
        "description": "CrowdStrike Holdings, Inc. provides cybersecurity products and services to stop breaches. It offers cloud-delivered protection across endpoints, cloud workloads, identity and data, and threat intelligence, managed security services, IT operations management, threat hunting, Zero Trust identity protection, and log management. CrowdStrike serves customers worldwide. The company was founded by George P. Kurtz, Gregg Marston, and Dmitri Alperovitch on November 7, 2011, and is headquartered in Austin, TX.",
        "peratio": "nan",
        "expectedpe": 166.46,
        "expectedpeg": "92.25 - 242.00",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 4789565,
        "debtEquity": "nan",
        "totalCurrentAssets": "0.00 x 900",
        "totalCurrentLiab": "125.00 - 134.96",
        "currentRatio": -0.77
    },
    {
        "ticker": "ZM",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Software—Application",
        "description": "Zoom Video Communications, Inc. engages in the provision of video-first communications platform. The firm offers meetings, chat, rooms and workspaces, phone systems, video webinars, marketplace, and developer platform products. It serves the education, finance, government, and healthcare industries. Its platform helps people to connect through voice, chat, content sharing, and face-to-face video experiences. The company was founded by Eric S. Yuan in 2011 and is headquartered in San Jose, CA.",
        "peratio": 208.82,
        "expectedpe": 85.56,
        "expectedpeg": "63.55 - 127.37",
        "dividendYield": "0.00 x 1000",
        "totalLiabilities": 3905365,
        "debtEquity": -0.22,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "68.29 - 70.31",
        "currentRatio": 0.33
    },
    {
        "ticker": "DDOG",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Software—Application",
        "description": "Datadog, Inc. engages in the development of a monitoring and analytics platform for developers, information technology operations teams and business users. Its platform integrates and automates infrastructure monitoring, application performance monitoring and log management to provide real-time observability of its customers' entire technology stack. The company was founded by Olivier Pomel and Alexis Lê-Quôc on June 4, 2010, and is headquartered in New York, NY.",
        "peratio": "nan",
        "expectedpe": 102.9,
        "expectedpeg": "61.34 - 159.00",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 4718686,
        "debtEquity": 0.99,
        "totalCurrentAssets": "0.00 x 900",
        "totalCurrentLiab": "70.99 - 75.22",
        "currentRatio": -0.16
    },
    {
        "ticker": "AZN",
        "exchange": "NASDAQ",
        "sector": "Healthcare",
        "type": "Stock",
        "industry": "Drug Manufacturers—General",
        "description": "AstraZeneca Plc is a holding company, which engages in the research, development, and manufacture of pharmaceutical products. It focuses on the discovery, development, and commercialization of prescription medicines in Oncology and BioPharmaceuticals, including Cardiovascular, Renal & Metabolism, and Respiratory & Immunology. These pharmaceutical products are then manufactured, marketed and sold. The company was founded on June 17, 1992 and is headquartered in Cambridge, the United Kingdom.",
        "peratio": 61.07,
        "expectedpe": 76.71,
        "expectedpeg": "52.65 - 72.12",
        "dividendYield": "0.00 x 900",
        "totalLiabilities": 4904423,
        "debtEquity": 0.17,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "63.77 - 64.51",
        "currentRatio": 1.05
    },
    {
        "ticker": "LULU",
        "exchange": "NASDAQ",
        "sector": "Consumer Cyclical",
        "type": "Stock",
        "industry": "Apparel Retail",
        "description": "lululemon athletica, Inc. engages in the designing, distributing and retail of athletic apparel and accessories. It operates through the following business segments: Company-Operated Stores, Direct to Consumer. The Company-Operated Stores segment comprises lululemon and ivivva brands; and specialize in athletic wear for female youth. The Direct to Consumer segment is involved in the e-commerce business, building brand awareness, particularly in new markets. The company was founded by Dennis J. Wilson in 1998 and is headquartered in Vancouver, Canada.",
        "peratio": 34.14,
        "expectedpe": 377.27,
        "expectedpeg": "251.51 - 410.70",
        "dividendYield": "0.00 x 1000",
        "totalLiabilities": 1725918,
        "debtEquity": 1.35,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "300.66 - 307.27",
        "currentRatio": 8.96
    },
    {
        "ticker": "CEG",
        "exchange": "NASDAQ",
        "sector": "Utilities",
        "type": "Stock",
        "industry": "Utilities—Renewable",
        "description": "Constellation Energy Corp. engages in the generation, supply, and marketing of clean energy electricity, and renewable energy products and solutions. It operates under the following geographical segments: Mid-Atlantic, Midwest, New York, Texas, and Other Power Regions Segment. The company is headquartered in Baltimore, MD.",
        "peratio": "nan",
        "expectedpe": 97.77,
        "expectedpeg": "48.29 - 97.89",
        "dividendYield": "0.00 x 1000",
        "totalLiabilities": 2012339,
        "debtEquity": "nan",
        "totalCurrentAssets": "0.00 x 900",
        "totalCurrentLiab": "77.10 - 78.45",
        "currentRatio": -0.49
    },
    {
        "ticker": "RIVN",
        "exchange": "NASDAQ",
        "sector": "Consumer Cyclical",
        "type": "Stock",
        "industry": "Auto Manufacturers",
        "description": "Rivian Automotive, Inc. engages in the design, development, and manufacture of category-defining electric vehicles and accessories. The company was founded by Robert J. Scaringe in June 2009 and is headquartered in Irvine, CA.",
        "peratio": "nan",
        "expectedpe": 32.35,
        "expectedpeg": "14.21 - 56.76",
        "dividendYield": "0.00 x 1100",
        "totalLiabilities": 29093555,
        "debtEquity": "nan",
        "totalCurrentAssets": "0.00 x 1400",
        "totalCurrentLiab": "14.21 - 15.23",
        "currentRatio": -14.53
    },
    {
        "ticker": "GFS",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Semiconductors",
        "description": "GLOBALFOUNDRIES, Inc. provides foundry services and manufactures semiconductors. It offers global shuttle, mask, post-fab and turnkey services. The company was founded in 2009 and is headquartered in Malta, NY.",
        "peratio": 24.82,
        "expectedpe": 78,
        "expectedpeg": "36.81 - 79.49",
        "dividendYield": "0.00 x 1100",
        "totalLiabilities": 2160193,
        "debtEquity": "nan",
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "65.40 - 67.97",
        "currentRatio": 2.72
    },
    {
        "ticker": "WBD",
        "exchange": "NASDAQ",
        "sector": "Communication Services",
        "type": "Stock",
        "industry": "Entertainment",
        "description": "Warner Bros. Discovery, Inc. operates as a media and entertainment company. It creates and distributes a portfolio of content and brands across television, film, and streaming. Its brands and products include Discovery Channel, discovery+, CNN, CNN+, DC, Eurosport, HBO, HBO Max, HGTV, Food Network, Investigation Discovery, TLC, TNT, TBS, truTV, Travel Channel, MotorTrend, Animal Planet, Science Channel, Warner Bros. Pictures, New Line Cinema, Cartoon Network, Adult Swim, and Turner Classic Movies. The company was founded April 8, 2022 and is headquartered in New York, NY.",
        "peratio": "nan",
        "expectedpe": 20.86,
        "expectedpeg": "8.82 - 27.66",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 26339638,
        "debtEquity": 1.5,
        "totalCurrentAssets": "0.00 x 800",
        "totalCurrentLiab": "14.74 - 15.38",
        "currentRatio": -3.87
    },
    {
        "ticker": "COST",
        "exchange": "NASDAQ",
        "sector": "Consumer Defensive",
        "type": "Stock",
        "industry": "Discount Stores",
        "description": "Costco Wholesale Corp. engages in the operation of membership warehouses through wholly owned subsidiaries. It operates through the following geographical segments: United States, Canada, and Other International Operations. The company was founded by James D. Sinegal and Jeffrey H. Brotman in 1983 and is headquartered in Issaquah, WA.",
        "peratio": 35.69,
        "expectedpe": 547.56,
        "expectedpeg": "406.51 - 612.27",
        "dividendYield": "0.00 x 1100",
        "totalLiabilities": 2019484,
        "debtEquity": 0.79,
        "totalCurrentAssets": "0.00 x 900",
        "totalCurrentLiab": "481.20 - 486.84",
        "currentRatio": 13.62
    },
    {
        "ticker": "KDP",
        "exchange": "NASDAQ",
        "sector": "Consumer Defensive",
        "type": "Stock",
        "industry": "Beverages—Non-Alcoholic",
        "description": "Keurig Dr Pepper, Inc. engages in the production and marketing of non-alcoholic beverages. It operates through the following segments: Coffee Systems, Packaged Beverages, Beverage Concentrates, and Latin America Beverages. The Coffee Systems segment includes the manufacture and distribution of finished goods relating to coffee, pods, and brewers. The Packaged Beverages segment offers finished beverages and other products, including owned brands and third-party brands. The Beverage Concentrates segment sells branded concentrates and syrup to third-party bottlers. The Latin America Beverages segment refers to sales in Mexico, the Caribbean, and other international markets from the production of concentrates, syrup, and finished beverages. The company was founded in 2018 and is headquartered in Burlington, MA.",
        "peratio": 34.44,
        "expectedpe": 39.72,
        "expectedpeg": "33.35 - 41.31",
        "dividendYield": "0.00 x 800",
        "totalLiabilities": 7258072,
        "debtEquity": 0.58,
        "totalCurrentAssets": "0.00 x 1000",
        "totalCurrentLiab": "34.62 - 35.09",
        "currentRatio": 1.01
    },
    {
        "ticker": "LCID",
        "exchange": "NASDAQ",
        "sector": "Consumer Cyclical",
        "type": "Stock",
        "industry": "Auto Manufacturers",
        "description": "Lucid Group, Inc. manufactures electric vehicles. It designs, develops, and builds energy storage systems for electric vehicles and supplies automakers with the battery pack system needed to power hybrid, plug-in, and electric vehicles. The company was founded in December 2007 and is headquartered in Newark, CA.",
        "peratio": "nan",
        "expectedpe": 11.32,
        "expectedpeg": "6.09 - 28.14",
        "dividendYield": "0.00 x 4000",
        "totalLiabilities": 33406831,
        "debtEquity": 1.19,
        "totalCurrentAssets": "0.00 x 1800",
        "totalCurrentLiab": "8.16 - 8.44",
        "currentRatio": -1.46
    },
    {
        "ticker": "ADP",
        "exchange": "NASDAQ",
        "sector": "Industrials",
        "type": "Stock",
        "industry": "Staffing & Employment Services",
        "description": "Automatic Data Processing, Inc. engages in the provision of business outsourcing solutions specializing in cloud-based human capital management. It operates through the following business segments: Employer Services, Professional Employer Organization Services, and Other. The Employer Services segment provides clients ranging from single-employee small businesses to large enterprises with tens of thousands of employees around the world, offering a range of human resources outsourcing and technology-based human capital management solutions, including strategic, cloud-based platforms. The Professional Employer Organization Services segment offers small and mid-sized businesses a human resources outsourcing solution through a co-employment mode. The company was founded by Henry Taub in 1949 and is headquartered in Roseland, NJ.",
        "peratio": 29.52,
        "expectedpe": 247.81,
        "expectedpeg": "196.61 - 274.92",
        "dividendYield": "0.00 x 1000",
        "totalLiabilities": 1924832,
        "debtEquity": 0.82,
        "totalCurrentAssets": "0.00 x 1000",
        "totalCurrentLiab": "220.35 - 222.66",
        "currentRatio": 7.52
    },
    {
        "ticker": "MAR",
        "exchange": "NASDAQ",
        "sector": "Consumer Cyclical",
        "type": "Stock",
        "industry": "Lodging",
        "description": "Marriott International, Inc. engages in the operation and franchise of hotel, residential, and timeshare properties. It operates through the following geography segments: U.S. & Canada, Asia Pacific, and Europe, Middle East and Africa (EMEA). The company was founded by J. Willard Marriott and Alice Sheets Marriott in 1927 and is headquartered in Bethesda, MD.",
        "peratio": 23.96,
        "expectedpe": 180.59,
        "expectedpeg": "131.01 - 195.90",
        "dividendYield": "0.00 x 900",
        "totalLiabilities": 1837418,
        "debtEquity": 1.59,
        "totalCurrentAssets": "0.00 x 3100",
        "totalCurrentLiab": "172.41 - 174.93",
        "currentRatio": 7.24
    },
    {
        "ticker": "AMAT",
        "exchange": "NASDAQ",
        "sector": "Technology",
        "type": "Stock",
        "industry": "Semiconductor Equipment & Materials",
        "description": "Applied Materials, Inc. provides manufacturing equipment, services and software to the semiconductor, display and related industries. It operates through the following segments: Semiconductor Systems, Applied Global Services, and Display & Adjacent Markets. The Semiconductor Systems segment includes semiconductor capital equipment for etch, rapid thermal processing, deposition, chemical mechanical planarization, metrology and inspection, wafer packaging, and ion implantation. The Applied Global Services segment provides solutions to optimize equipment, performance, and productivity. The Display & Adjacent Markets segment offers products for manufacturing liquid crystal displays, organic light-emitting diodes, equipment upgrades, and other display technologies for TVs, monitors, laptops, personal computers, smart phones, and other consumer-oriented devices. The company was founded on November 10, 1967 and is headquartered in Santa Clara, CA.",
        "peratio": 15.9,
        "expectedpe": 129.51,
        "expectedpeg": "71.12 - 142.01",
        "dividendYield": "0.00 x 900",
        "totalLiabilities": 6358142,
        "debtEquity": 1.61,
        "totalCurrentAssets": "0.00 x 900",
        "totalCurrentLiab": "116.62 - 119.10",
        "currentRatio": 7.46
    }
]