{
    "list": [
        {
            "ticker": "CPRT",
            "exchange": "NASDAQ",
            "sector": "Consumer Cyclical",
            "type": "Stock",
            "industry": "Auto & Truck Dealerships",
            "description": "Copart, Inc. engages in the provision of online auctions and vehicle remarketing services. It provides vehicle sellers with a full range of services to process and sell vehicles primarily over the internet through Virtual Bidding Third Generation Internet auction-style sales technology. The firm sells the vehicles principally to licensed vehicle dismantlers, rebuilders, repair licensees, used vehicle dealers, and exporters and at certain locations, as well as to the general public. The company’s services include online seller access, salvage estimation services, estimating services, end-of-life vehicle processing, virtual insured exchange, transportation services, vehicle inspection stations, on-demand reporting, DMV processing, and vehicle processing programs. It operates through the United States and International segments. Copart was founded by Willis J. Johnson in 1982 and is headquartered in Dallas, TX.",
            "peratio": 31.51,
            "expectedpe": 80.71,
            "expectedpeg": "51.10 - 71.68",
            "dividendYield": "0.00 x 1200",
            "totalLiabilities": 1842350,
            "debtEquity": 1.21,
            "totalCurrentAssets": "0.00 x 900",
            "totalCurrentLiab": "70.27 - 71.25",
            "currentRatio": 2.26
        },
        {
            "ticker": "AMGN",
            "exchange": "NASDAQ",
            "sector": "Healthcare",
            "type": "Stock",
            "industry": "Drug Manufacturers—General",
            "description": "Amgen, Inc. is a biotechnology company, which engages in the discovery, development, manufacture, and marketing of human therapeutics. It operates through Human Therapeutics segment. The company was founded by William K. Bowes, Jr., Franklin Pitcher Johnson, Jr., George B. Rathmann, and Joseph Rubinfeld on April 8, 1980 and is headquartered in Thousand Oaks, CA.",
            "peratio": 18.86,
            "expectedpe": 258.76,
            "expectedpeg": "223.30 - 296.67",
            "dividendYield": "0.00 x 900",
            "totalLiabilities": 2509840,
            "debtEquity": 0.65,
            "totalCurrentAssets": "0.00 x 1200",
            "totalCurrentLiab": "227.37 - 231.80",
            "currentRatio": 12.11
        }
    ]
}